chepo92/ArduinoCore-sam/boards.txt
motionbow.name=Motionbow
motionbow.vid.0=0x2341
motionbow.pid.0=0x003e
motionbow.upload.tool=bossac
motionbow.upload.protocol=sam-ba
motionbow.upload.maximum_size=262144
motionbow.upload.use_1200bps_touch=true
motionbow.upload.wait_for_upload_port=true
motionbow.upload.native_usb=true
motionbow.build.mcu=cortex-m4
motionbow.build.f_cpu=120000000ul
motionbow.build.usb_manufacturer="LaserX"
motionbow.build.usb_product="laserX bow"
motionbow.build.board=MOTIONBOW
motionbow.build.core=arduino
motionbow.build.arch=SAM4S4A
motionbow.build.extra_flags=-D__SAM4S4A__ -mthumb {build.usb_flags}
motionbow.build.ldscript=linker_scripts/gcc/flash.ld
motionbow.build.variant=motionbow
motionbow.build.variant_system_lib=libsam_sam4s4a_gcc_rel.a
motionbow.build.vid=0x2341
motionbow.build.pid=0x003e

sam4e8e_baremetal.name=SAM4E8E_BM
sam4e8e_baremetal.vid.0=0x2341
sam4e8e_baremetal.pid.0=0x003e
sam4e8e_baremetal.upload.tool=bossac
sam4e8e_baremetal.upload.protocol=sam-ba
sam4e8e_baremetal.upload.maximum_size=262144
sam4e8e_baremetal.upload.use_1200bps_touch=true
sam4e8e_baremetal.upload.wait_for_upload_port=true
sam4e8e_baremetal.upload.native_usb=true
sam4e8e_baremetal.build.mcu=cortex-m4
sam4e8e_baremetal.build.f_cpu=120000000ul
sam4e8e_baremetal.build.usb_manufacturer="Microchip"
sam4e8e_baremetal.build.usb_product="USB CDC"
sam4e8e_baremetal.build.board=sam4e8e_baremetal
sam4e8e_baremetal.build.core=baremetal
sam4e8e_baremetal.build.arch=SAM4E8E
sam4e8e_baremetal.build.extra_flags=-D__SAM4E8E__ -mthumb {build.usb_flags}
sam4e8e_baremetal.build.ldscript=linker_scripts/gcc/flash.ld
sam4e8e_baremetal.build.variant=sam4e8e_baremetal
sam4e8e_baremetal.build.variant_system_lib=none
sam4e8e_baremetal.build.vid=0x2341
sam4e8e_baremetal.build.pid=0x003e